$(document).ready(function(){

   $("#auto").autocomplete({source:["Австралия","Австрия",
"Азербайджан","Аргентина","Афганистан", "Бангладеш", "Беларусь",
"Бразилия", "Великобритания", "Вьетнам", "Германия", "Греция",
"Грузия","Дания","Египет","Израиль", "Ирак", "Иран", "Испания",
"Италия","Канада","Киргизия","КНР","Куба","Латвия",
"Литва","Мексика","Молдавия","Монголия","Нигерия","Нидерланды",
"Пакистан","Польша","Португалия","Россия","Румыния","Сербия",
"Словакия","Словения","США","Таджикистан","Таиланд","Тунис","Турция",
"Узбекистан","Украина","Филиппины","Финляндия","Франция",
"Хорватия","Черногория","Чехия","Швейцария","Швеция","Эстония",
"ЮАР","Япония"], minLength:"3"});
});